Table of Contents
 Interface IIdeaElement2D
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
Representation of element2D
public interface IIdeaElement2D : IIdeaObject
Inherited Members
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 EccentricityZ
Displacement in local axis Z
double EccentricityZ { get; }
Property Value
double
 ElementType
Analysis type - shell, plate, wall
Element2DType ElementType { get; }
Property Value
Element2DType
 GeometricRegion
Geometry region of element2D
IIdeaRegion3D GeometricRegion { get; }
Property Value
IIdeaRegion3D
 InnerLines
Inner lines of this region
List<IIdeaPolyLine3D> InnerLines { get; }
Property Value
List<IIdeaPolyLine3D>
 InnerPoints
Inner points of this region
List<IIdeaNode> InnerPoints { get; }
Property Value
List<IIdeaNode>
 Material
Material
IIdeaMaterial Material { get; }
Property Value
IIdeaMaterial
 Thickness
Thicknes of Element2D
double Thickness { get; }
Property Value
double
 Edit this page